{
  "greeting": "Merhaba 👋, ben Emirhan",
  "roles": ["Yazılım Geliştirici", ".NET Developer", "Freelancer"],
  "hero_description": "Modern teknolojilerle kullanıcı dostu ve verimli uygulamalar geliştiriyorum.",
  "about_title": "Hakkımda",
  "about_text": "Merhaba! Ben Emirhan, fikirleri işlevsel ve güzel web uygulamalarına dönüştürmeyi seven bir yazılım geliştiricisiyim.",
  "education_title": "Eğitim",
  "education": [
    {
      "year": "2021 - 2025",
      "degree": "Yazılım Mühendisliği Lisans Programı",
      "school": "Ankara Bilim Üniversitesi",
      "description": "Geçirdiğim 4 yıl içinde, ürünlerin gelişim sürecinde kullanılan yazılım mimarileri, süreçler ve teknolojiler hakkında derinlemesine bilgi edindim."
    }
  ],
  "experience_title": "Deneyim",
  "experience": [
    {
      "position": ".NET Geliştirici",
      "company": "Finex Soft",
      "duration": "2025 Haziran - 2025 Ekim",
      "description": "Finex Soft’ta, kurumsal yazılım projelerinin geliştirilmesi ve bakım süreçlerinde aktif rol alıyorum. .NET teknolojileri ile arka uç geliştirme, EF Core ve Microsoft SQL Server üzerinde veri modelleme ve sorgu optimizasyonu yapıyorum. Docker ile konteyner tabanlı geliştirme ortamlarını yönetiyor, websocket teknolojileri ile gerçek zamanlı iletişim özellikleri ekliyorum. Yazılım mimarisi prensiplerine uygun, ölçeklenebilir ve sürdürülebilir çözümler geliştirmeye odaklanıyorum."
    },
    {
      "position": "Stajyer",
      "company": "Finex Soft",
      "duration": "2024 Ocak - 2025 Haziran",
      "description": "Finex Soft’ta staj sürecimde .NET, C# ve EF Core kullanarak arka uç geliştirme projelerinde aktif rol aldım. Microsoft SQL Server üzerinde veri tabanı tasarımları ve sorgu optimizasyonları gerçekleştirdim. MailKit kütüphanesi ile Outlook e-postalarını sistem içine entegre ederek kullanıcıların gelen kutusunu web arayüzünden yönetebileceği bir modül geliştirdim. Grafana ve Prometheus tabanlı bir monitoring altyapısı kurarak sistem performans metriklerini takip eden ve otomatik alarmlar üreten bir yapı tasarladım. WebSocket ile gerçek zamanlı bildirim sistemleri oluşturarak kullanıcı deneyimini iyileştirdim. QNAP sunucu bakımları, yedekleme ve kullanıcı yönetimi süreçlerinde görev aldım. Docker ile konteyner tabanlı geliştirme ortamları kurarak projelerin dağıtım ve test süreçlerini hızlandırdım."
    },
    {
        "position": "Gönüllü Stajyer",
        "company": "UppSoft",
        "duration": "2023 Mart - 2023 Haziran",
        "description": "Gönüllü olarak çalıştığım bu şirkette PHP yazılım dilini öğrendim, danışmanım bana yazılımla ilgili temelleri öğrenmem için proje verdi. Burada yaptığım staj süresince arkaplan geliştirme temellerini öğrendim"
    }
  ],
  "projects_title": "Projeler",
  "projects": [
    {
      "name": "Portföy Web Sitesi",
      "description": "React, Tailwind CSS ve Framer Motion ile geliştirilmiş kişisel portföy sitesi.",
      "tech": "React, Tailwind CSS, Framer Motion",
      "github": "https://github.com/yourusername/portfolio",
      "live": "#"
    },
    {
      "name": "Logic",
      "description": "Mezuniyet projem olan Logic bir iş bulma platformudur. Kullanıcılar iş ilanlarını görüntüleyebilir, başvurabilir ve işverenler ilan oluşturabilir.",
      "tech": "React, PostgreSQL, Swagger, .NET, Entity Framework, Cloudinary",
      "github": "https://github.com/imemirhan/Logic",
      "live": "#"
    }
  ],
  "contact_title": "İletişim",
  "contact_text": "Bana e-posta veya aşağıdaki sosyal bağlantılardan ulaşabilirsiniz."
}
